# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：把十六进数0x4DC0 转换成二进制、十进制、八进制格式输出。

输出示例：二进制100110111110010、十进制19954、八进制46762

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
      先将程序段中横线部分去掉，然后填写正确的程序内容
------------------------------------------------------'''

#**********Program**********

print("二进制{0:b}、十进制{0}、八进制{0:o}".format(0x4DC0))

#**********  End  **********

