# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：仅使用 Python 基本语法，即不使用任何模块，编写
      Python 程序计算下列数学表达式的结果并输出，数学
      表达式见样张，小数点后要求输出结果小数点后保留3
      位小数。

输出示例：
          123.456    (不是此题正确结果)
---- -----------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''

#**********Program**********
x=pow((3**4+5*(6**7))/8, 0.5)
print("{:.3f}".format(x))





#**********  End  **********

