# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：排序输出人名

描述：输入多个英文人名，以回车符结束，人名间以半角逗号( , )分隔，
      对这些人名进行升序排序并输出。

要求：

     输入格式：
    一行内输入多个人员，逗号分隔，回车结束
   
     输出格式：
     排序后的人名

示例1

输入示例                                                            

George Walker Bush,Kofi A. Annan,Albert Einstein,Thomas Alva Edison

输出示例

Albert Einstein
George Walker Bush
Kofi A. Annan
Thomas Alva Edison

---------------------------------------------------------
注意：仅在注释标志之间填入所编写语句。
------------------------------------------------------'''

#**********Program**********
s=input().split(',')
s=sorted(s)
for i in s:
      print(i)







#**********  End  **********

