#coding：utf-8
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：成绩转换

描述：编写一个学生成绩转换程序，用户输入百分制的学生成绩，
      成绩大于或等于60的输出“pass”，否则输出“fail”，成
      绩不四舍五入。

要求：

     输入格式：输入一个不超过100的正数，代表百分制成绩。


     输出格式：pass  或 fail



       输入示例    输出示例

 示例1    88         pass
 示例2    59.9       fail
---------------------------------------------------------
注意：仅在注释标志之间填入所编写语句。
------------------------------------------------------'''

#**********Program**********
score=eval(input())
if score>=60:
      print('pass')
else:
      print('fail')

#**********  End  **********
