# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：判断奇偶数

描述：用户输入一个正整数，判断该数是奇数还是偶数，如果奇数输出odd，
      偶数则输出even。

要求：

     输入格式：输入一个正整数


     输出格式：奇数输出odd，偶数则输出even。



      输入示例    输出示例

 示例1   9          odd
 示例2   2          even
---------------------------------------------------------
注意：仅在注释标志之间填入所编写语句。
------------------------------------------------------'''

#**********Program**********
number=eval(input())
if number%2==1:
      print("odd")
else:
      print("even")




#**********  End  **********

