# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：判断是否直角三角形

要求：输入三个数a,b,c, 判断能否以它们为三个边长构成直角三角形。若能，输出YES，否则输出NO。

描述：


     输入格式：输入包括三行,每行是一个数字


     输出格式：'YES' 或'NO'



      输入示例    输出示例

 示例1   3          YES
         4
         5
---------------------------------------------------------
注意：仅在注释标志之间填入所编写语句。
------------------------------------------------------'''

#**********Program**********
a=eval(input())
b=eval(input())
c=eval(input())
if a*a+b*b==c*c or a*a+c*c==b*b or c*c+b*b==a*a:
     print("YES")
else:
     print("NO")




#**********  End  **********

