# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：a除以b

描述：输出实数a除以b的结果，计算结果四舍五入，保留2位小数。


要求：

     输入格式：输入包括两行, 每行一个实数, b不能等于0


     输出格式：当用户输入b为0时输出"除零错误"

               其他情况下输出一个保留2位小数的实数



      输入示例    输出示例

 示例1    5       除零错误
          0
 示例2    5.0     1.67
          3
---------------------------------------------------------
注意：仅在注释标志之间填入所编写语句。
------------------------------------------------------'''

#**********Program**********
a=float(input())
b=float(input())
if b!=0:
     print('{:.2f}'.format(a/b))
else:
     print('除零错误')





#**********  End  **********

