# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：人生苦短我用python

描述：输入一个小于等于12的整数n，逐个输出字符串 '人生苦短我用python' 
      中前n个字符，每个字符后输出一个半角逗号和一个空隔。

要求：

     输入格式：一个小于等于12的整数n


     输出格式：'人生苦短我用python' 中前n个字符



      输入示例    输出示例

 示例1  2          人, 生,
---------------------------------------------------------
注意：仅在注释标志之间填入所编写语句。
------------------------------------------------------'''

#**********Program**********
n=int(input())
s='人生苦短我用python'
for i in range(n):
    print(s[i],end=',') 



#**********  End  **********

