#coding：utf-8 
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：数列求和

描述：给定某数字A（1≤A≤9）以及非负整数N（0≤N≤100000），
      求数列之和S=A+AA+AAA+?+AA?A（N个A）。例如A=1, N=3时，
      sum=1+11+111=123。

要求：

     输入格式：
     两行输入：
     第一行输入一个整数A，且该数介于1至9之间（包含1和9）
     第二行输入一个非负整数N

     输出格式：
     输出其N项数列之和sum的值。
     当输入不符合要求时输出：'data error'


        输入示例    输出示例

 示例1   1            123
         3
 示例2   6          data error         
        -6
---------------------------------------------------------
注意：仅在注释标志之间填入所编写语句。
------------------------------------------------------'''
#**********Program**********
A=int(input())
N=int(input())
S=0
if A>=1 and A<=9 and N>=0 and N<=100000:
    for i in range(1,N+1):
        S+=eval(str(A)*i)
    print(S)

else:
    print("data error")



#**********  End  **********

'''
a=input()
n=int(input())
s=0
if n>=0 and '1'<=a<='0':
    for i in range(1,n+1):
        s=s+int(a*i)
    print(s)
else:
    print("data error")
'''
