#coding：utf-8 
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：根据斐波那契数列的定义，F(0)=0，F(1)=1, F(n)=F(n–1)+F(n–2)(n≥2)，
      输出不大于 100 的序列元素


---------------------------------------------------------
注意：部分源程序给出如下。请勿改动其它函数中的任何内容，
      仅在函数的注释标志之间填入所编写的若干语句。
      先将程序段中横线部分去掉，然后填写正确的程序内容
------------------------------------------------------'''

a,b = 0, 1

#**********Program**********

while a<=100:
    print(a, end = ",")
    a,b=b,a+b

#**********  End  **********